IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART4_UART4.xml
<module name="UART4_UART4" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="UART4_DLL" acronym="UART4_DLL" offset="0x0" width="8" description="">
		<bitfield id="CLOCK_LSB" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit LSB divisor value" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART4_RHR" acronym="UART4_RHR" offset="0x0" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RHR" width="8" begin="7" end="0" resetval="0x0" description="Receive holding register" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="UART4_THR" acronym="UART4_THR" offset="0x0" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="THR" width="8" begin="7" end="0" resetval="0x0" description="TRANSMIT HOLDING REGISTER" range="7 - 0" rwaccess="WO"/>
	</register>
	<register id="UART4_DLH" acronym="UART4_DLH" offset="0x4" width="8" description="">
		<bitfield id="CLOCK_MSB" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit MSB divisor value" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART4_IER_CIR" acronym="UART4_IER_CIR" offset="0x4" width="8" description="">
		<bitfield id="NOT_USED2" width="2" begin="7" end="6" resetval="0x0" description="Not Defined" range="7 - 6" rwaccess="RW"/> 
		<bitfield id="TX_STATUS_IT" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    0   |   TX_STATUS_IT_VALUE_0Disables the TX status interrupt.      1   |   TX_STATUS_IT_VALUE_1Enables the TX status interrupt.  " range="5" rwaccess="RW"/> 
		<bitfield id="NOT_USED1" width="1" begin="4" end="4" resetval="0x0" description="Not Defined" range="4" rwaccess="RW"/> 
		<bitfield id="RX_OVERRUN_IT" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    0   |   RX_OVERRUN_IT_VALUE_0Disables the RX overrun interrupt.      1   |   RX_OVERRUN_IT_VALUE_1Enables the RX overrun interrupt.  " range="3" rwaccess="RW"/> 
		<bitfield id="RX_STOP_IT" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    0   |   RX_STOP_IT_VALUE_0Disables the receive stop interrupt.      1   |   RX_STOP_IT_VALUE_1Enables the receive stop interrupt.  " range="2" rwaccess="RW"/> 
		<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    0   |   THR_IT_VALUE_0Disables the THR interrupt.      1   |   THR_IT_VALUE_1Enables the THR interrupt.  " range="1" rwaccess="RW"/> 
		<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    0   |   RHR_IT_VALUE_0Disables the RHR interrupt.      1   |   RHR_IT_VALUE_1Enables the RHR interrupt.  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART4_IER_IRDA" acronym="UART4_IER_IRDA" offset="0x4" width="8" description="">
		<bitfield id="EOF_IT" width="1" begin="7" end="7" resetval="0x0" description="Not Defined    0   |   EOF_IT_VALUE_0Disables the received EOF interrupt.      1   |   EOF_IT_VALUE_1Enables the received EOF interrupt.  " range="7" rwaccess="RW"/> 
		<bitfield id="LINE_STS_IT" width="1" begin="6" end="6" resetval="0x0" description="Not Defined    0   |   LINE_STS_IT_VALUE_0Disables the receiver line status interrupt.      1   |   LINE_STS_IT_VALUE_1Enables the receiver line status interrupt.  " range="6" rwaccess="RW"/> 
		<bitfield id="TX_STATUS_IT" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    0   |   TX_STATUS_IT_VALUE_0Disables the TX status interrupt.      1   |   TX_STATUS_IT_VALUE_1Enables the TX status interrupt.  " range="5" rwaccess="RW"/> 
		<bitfield id="STS_FIFO_TRIG_IT" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    0   |   STS_FIFO_TRIG_IT_VALUE_0Disables the status FIFO trigger level interrupt.      1   |   STS_FIFO_TRIG_IT_VALUE_1Enables the status FIFO trigger level interrupt.  " range="4" rwaccess="RW"/> 
		<bitfield id="RX_OVERRUN_IT" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    0   |   RX_OVERRUN_IT_VALUE_0Disables the RX overrun interrupt.      1   |   RX_OVERRUN_IT_VALUE_1Enables the RX overrun interrupt.  " range="3" rwaccess="RW"/> 
		<bitfield id="LAST_RX_BYTE_IT" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    0   |   LAST_RX_BYTE_IT_VALUE_0Disables the last byte of frame in RX FIFO interrupt.      1   |   LAST_RX_BYTE_IT_VALUE_1Enables the last byte of frame in RX FIFO interrupt.  " range="2" rwaccess="RW"/> 
		<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    0   |   THR_IT_VALUE_0Disables the THR interrupt.      1   |   THR_IT_VALUE_1Enables the THR interrupt.  " range="1" rwaccess="RW"/> 
		<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    0   |   RHR_IT_VALUE_0Disables the RHR interrupt.      1   |   RHR_IT_VALUE_1Enables the RHR interrupt.  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART4_IER_UART" acronym="UART4_IER_UART" offset="0x4" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="CTS_IT" width="1" begin="7" end="7" resetval="0x0" description="Not Defined    0   |   CTS_IT_VALUE_0Disables the CTS* interrupt      1   |   CTS_IT_VALUE_1Enables the CTS* interrupt  " range="7" rwaccess="RW"/> 
		<bitfield id="RTS_IT" width="1" begin="6" end="6" resetval="0x0" description="Not Defined    0   |   RTS_IT_VALUE_0Disables the RTS* interrupt      1   |   RTS_IT_VALUE_1Enables the RTS* interrupt  " range="6" rwaccess="RW"/> 
		<bitfield id="XOFF_IT" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    0   |   XOFF_IT_VALUE_0Disables the XOFF interrupt      1   |   XOFF_IT_VALUE_1Enables the XOFF interrupt  " range="5" rwaccess="RW"/> 
		<bitfield id="SLEEP_MODE" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    0   |   SLEEP_MODE_VALUE_0Disables sleep mode      1   |   SLEEP_MODE_VALUE_1Enables sleep mode (stop baud rate clock when the module is inactive)  " range="4" rwaccess="RW"/> 
		<bitfield id="MODEM_STS_IT" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    0   |   MODEM_STS_IT_VALUE_0Disables the modem status register interrupt      1   |   MODEM_STS_IT_VALUE_1Enables the modem status register interrupt  " range="3" rwaccess="RW"/> 
		<bitfield id="LINE_STS_IT" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    0   |   LINE_STS_IT_U_VALUE_0Disables the receiver line status interrupt      1   |   LINE_STS_IT_U_VALUE_1Enables the receiver line status interrupt  " range="2" rwaccess="RW"/> 
		<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    0   |   THR_IT_VALUE_0Disables the THR interrupt      1   |   THR_IT_VALUE_1Enables the THR interrupt  " range="1" rwaccess="RW"/> 
		<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    0   |   RHR_IT_VALUE_0Disables the RHR interrupt and time out interrupt.      1   |   RHR_IT_VALUE_1Enables the RHR interrupt and time out interrupt.  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART4_EFR" acronym="UART4_EFR" offset="0x8" width="8" description="">
		<bitfield id="AUTO_CTS_EN" width="1" begin="7" end="7" resetval="0x0" description="Auto-CTS enable bit. 0: Normal operation. 1: Auto-CTS flow control is enabled i.e. transmission is halted when the CTS* pin is high (inactive)." range="7" rwaccess="RW"/> 
		<bitfield id="AUTO_RTS_EN" width="1" begin="6" end="6" resetval="0x0" description="Auto-RTS enable bit. 0: Normal operation. 1: Auto- RTS flow control is enabled i.e. RTS* pin goes high (inactive) when the receiver FIFO HALT trigger level, TCR[3:0], is reached, and goes low (active) when the receiver FIFO RESTORE transmission trigger level is reached." range="6" rwaccess="RW"/> 
		<bitfield id="SPECIAL_CHAR_DETECT" width="1" begin="5" end="5" resetval="0x0" description="0: Normal operation. 1: Special character detect enable. Received data is compared with XOFF2 data. If a match occurs the received data is transferred to RX FIFO and IIR bit 4 is set to 1 to indicate a special character has been detected." range="5" rwaccess="RW"/> 
		<bitfield id="ENHANCED_EN" width="1" begin="4" end="4" resetval="0x0" description="Enhanced functions write enable bit. 0: Disables writing to IER bits 4-7, FCR bits 4-5, and MCR bits 5-7. 1: Enables writing to IER bits 4-7, FCR bits 4-5, and MCR bits 5-7." range="4" rwaccess="RW"/> 
		<bitfield id="SW_FLOW_CONTROL" width="4" begin="3" end="0" resetval="0x0" description="Combinations of Software flow control can be selected by programming bit 3 - bit 0. See Software Flow Control Options" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="UART4_FCR" acronym="UART4_FCR" offset="0x8" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RX_FIFO_TRIG" width="2" begin="7" end="6" resetval="0x0" description="Sets the trigger level for the RX FIFO:If SCR[7] = 0 and TLR[7:4] = 0000:00:   8 characters01: 16 characters10: 56 characters11: 60 charactersIf SCR[7] = 0 and TLR[7:4] != 0000, RX_FIFO_TRIG is not considered.If SCR[7]=1, RX_FIFO_TRIG is 2 LSB of the trigger level [1-63 on 6 bits] with the granularity 1." range="7 - 6" rwaccess="WO"/> 
		<bitfield id="TX_FIFO_TRIG" width="2" begin="5" end="4" resetval="0x0" description="Sets the trigger level for the TX FIFO:If SCR[6] = 0 and TLR[3:0] = 0000:00:   8 spaces01: 16 spaces10: 32 spaces11: 56 spacesIf SCR[6] = 0 and TLR[3:0] != 0000, TX_FIFO_TRIG is not considered.If SCR[6]=1, TX_FIFO_TRIG is 2 LSB of the trigger level [1-63 on 6 bits] with the granularity 1" range="5 - 4" rwaccess="WO"/> 
		<bitfield id="DMA_MODE" width="1" begin="3" end="3" resetval="0x0" description="This register is considered if SCR[0] = 0.    Write0   |   DMA_MODE_VALUE_0DMA_MODE 0 (No DMA)      Write1   |   DMA_MODE_VALUE_1DMA_MODE 1 (UART_nDMA_REQ[0] in TX, UART_nDMA_REQ[1] in RX)  " range="3" rwaccess="WO"/> 
		<bitfield id="TX_FIFO_CLEAR" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    Write0   |   TX_FIFO_CLEAR_VALUE_0No change      Write1   |   TX_FIFO_CLEAR_VALUE_1Clears the transmit FIFO and resets its counter logic to zero. Returns to zero after clearing FIFO.  " range="2" rwaccess="WO"/> 
		<bitfield id="RX_FIFO_CLEAR" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    Write0   |   RX_FIFO_CLEAR_VALUE_0No change      Write1   |   RX_FIFO_CLEAR_VALUE_1Clears the receive FIFO and resets its counter logic to zero. Returns to zero after clearing FIFO.  " range="1" rwaccess="WO"/> 
		<bitfield id="FIFO_EN" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    Write0   |   FIFO_EN_VALUE_0Disables the transmit and receive FIFOs. The transmit and receive holding registers are one byte FIFOs.      Write1   |   FIFO_EN_VALUE_1: Enables the transmit and receive FIFOs.The transmit and receive holding registers are 64-bytes FIFOs.  " range="0" rwaccess="WO"/>
	</register>
