IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART4_UART4.xml
	<register id="UART4_IIR_CIR" acronym="UART4_IIR_CIR" offset="0x8" width="8" description="">
		<bitfield id="TX_STATUS_IT" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    Read0   |   TX_STATUS_IT_VALUE_0TX status interrupt inactive      Read1   |   TX_STATUS_IT_VALUE_1TX status interrupt active  " range="5" rwaccess="RO"/> 
		<bitfield id="RX_OE_IT" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    Read0   |   RX_OE_IT_VALUE_0RX overrun interrupt inactive      Read1   |   RX_OE_IT_VALUE_1RX overrun interrupt active  " range="3" rwaccess="RO"/> 
		<bitfield id="RX_STOP_IT" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    Read0   |   RX_STOP_IT_VALUE_0Receive stop interrupt inactive      Read1   |   RX_STOP_IT_VALUE_1Receive stop interrupt active  " range="2" rwaccess="RO"/> 
		<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    Read0   |   THR_IT_VALUE_0THR interrupt inactive      Read1   |   THR_IT_VALUE_1THR interrupt active  " range="1" rwaccess="RO"/> 
		<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    Read0   |   RHR_IT_VALUE_0RHR interrupt inactive      Read1   |   RHR_IT_VALUE_1RHR interrupt active  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART4_IIR_IRDA" acronym="UART4_IIR_IRDA" offset="0x8" width="8" description="">
		<bitfield id="EOF_IT" width="1" begin="7" end="7" resetval="0x0" description="Not Defined    Read0   |   EOF_IT_VALUE_0Received EOF interrupt inactive      Read1   |   EOF_IT_VALUE_1Received EOF interrupt active  " range="7" rwaccess="RO"/> 
		<bitfield id="LINE_STS_IT" width="1" begin="6" end="6" resetval="0x0" description="Not Defined    Read0   |   LINE_STS_IT_VALUE_0Receiver line status interrupt inactive      Read1   |   LINE_STS_IT_VALUE_1Receiver line status interrupt active  " range="6" rwaccess="RO"/> 
		<bitfield id="TX_STATUS_IT" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    Read0   |   TX_STATUS_IT_VALUE_0TX status interrupt inactive      Read1   |   TX_STATUS_IT_VALUE_1TX status interrupt active  " range="5" rwaccess="RO"/> 
		<bitfield id="STS_FIFO_IT" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    Read0   |   STS_FIFO_IT_VALUE_0Status FIFO trigger level interrupt inactive      Read1   |   STS_FIFO_IT_VALUE_1Status FIFO trigger level interrupt active  " range="4" rwaccess="RO"/> 
		<bitfield id="RX_OE_IT" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    Read0   |   RX_OE_IT_VALUE_0RX overrun interrupt inactive      Read1   |   RX_OE_IT_VALUE_1RX overrun interrupt active  " range="3" rwaccess="RO"/> 
		<bitfield id="RX_FIFO_LAST_BYTE_IT" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    Read0   |   RX_FIFO_LAST_BYTE_IT_VALUE_0Last byte of frame in RX FIFO interrupt inactive      Read1   |   RX_FIFO_LAST_BYTE_IT_VALUE_1Last byte of frame in RX FIFO interrupt active  " range="2" rwaccess="RO"/> 
		<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    Read0   |   THR_IT_VALUE_0THR interrupt inactive      Read1   |   THR_IT_VALUE_1THR interrupt active  " range="1" rwaccess="RO"/> 
		<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    Read0   |   RHR_IT_VALUE_0RHR interrupt inactive      Read1   |   RHR_IT_VALUE_1RHR interrupt active  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART4_IIR_UART" acronym="UART4_IIR_UART" offset="0x8" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="FCR_MIRROR" width="2" begin="7" end="6" resetval="0x0" description="Mirror the contents of FCR[0] on both bits." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="IT_TYPE" width="5" begin="5" end="1" resetval="0x0" description="Not Defined    Read0x00   |   IT_TYPE_VALUE_0Modem Interrupt. Priority=4      Read0x01   |   IT_TYPE_VALUE_1THR interrupt.  Priority=3      Read0x02   |   IT_TYPE_VALUE_2RHR interrupt.  Priority=2      Read0x03   |   IT_TYPE_VALUE_3Receiver line status error.  Priority=3      Read0x06   |   IT_TYPE_VALUE_6Rx timeout.  Priority=2      Read0x08   |   IT_TYPE_VALUE_8Xoff/Special character.  Priority=5      Read0x10   |   IT_TYPE_VALUE_10CTS, RTS, DSR change state from active (low) to inactive (high). Priority=6  " range="5 - 1" rwaccess="RO"/> 
		<bitfield id="IT_PENDING" width="1" begin="0" end="0" resetval="0x1" description="Not Defined    Read0   |   IT_PENDING_VALUE_0An interrupt is pending      Read1   |   IT_PENDING_VALUE_1No interrupt is pending  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART4_LCR" acronym="UART4_LCR" offset="0xC" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="DIV_EN" width="1" begin="7" end="7" resetval="0x0" description="Not Defined    0   |   DIV_EN_VALUE_0Normal operating condition      1   |   DIV_EN_VALUE_1Divisor latch enable. Allows to access to DLL, DLH and other registers (refer to the registers mapping)  " range="7" rwaccess="RW"/> 
		<bitfield id="BREAK_EN" width="1" begin="6" end="6" resetval="0x0" description="Break control bit.    0   |   BREAK_EN_VALUE_0Normal operating condition.      1   |   BREAK_EN_VALUE_1Forces the transmitter output to go low to alert the communication terminal  " range="6" rwaccess="RW"/> 
		<bitfield id="PARITY_TYPE2" width="1" begin="5" end="5" resetval="0x0" description="Selects the forced parity format [if LCR[3] = 1]. If LCR[5] = 1 and LCR[4] = 0, the parity bit is forced to 1 in the transmitted and received data. If LCR[5] = 1 and LCR[4] = 1, the parity bit is forced to 0 in the transmitted and received data." range="5" rwaccess="RW"/> 
		<bitfield id="PARITY_TYPE1" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    0   |   PARITY_TYPE1_VALUE_0Odd parity is generated (if LCR[3] = 1)      1   |   PARITY_TYPE1_VALUE_1Even parity is generated (if LCR[3] = 1)  " range="4" rwaccess="RW"/> 
		<bitfield id="PARITY_EN" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    0   |   PARITY_EN_VALUE_0No parity      1   |   PARITY_EN_VALUE_1A parity bit is generated during transmission and the receiver checks for received parity.  " range="3" rwaccess="RW"/> 
		<bitfield id="NB_STOP" width="1" begin="2" end="2" resetval="0x0" description="Specifies the number of stop bits:    0   |   NB_STOP_VALUE_01 stop bits (word length = 5, 6, 7, 8)      1   |   NB_STOP_VALUE_11.5 stop bits (word length = 5) in USART mode. 2 stop bits (word length = 6, 7, 8)  " range="2" rwaccess="RW"/> 
		<bitfield id="CHAR_LENGTH" width="2" begin="1" end="0" resetval="0x0" description="Specifies the word length to be transmitted or received.    0x0   |   CHAR_LENGTH_VALUE_05 bits      0x1   |   CHAR_LENGTH_VALUE_16 bits      0x2   |   CHAR_LENGTH_VALUE_27 bits      0x3   |   CHAR_LENGTH_VALUE_38 bits  " range="1 - 0" rwaccess="RW"/>
	</register>
