IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART4_UART4.xml
	<register id="UART4_MSR" acronym="UART4_MSR" offset="0x18" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="NCD_STS" width="1" begin="7" end="7" resetval="0x0" description="This bit is the complement of the DCD* input. In loop-back mode it is equivalent to MCR[3]" range="7" rwaccess="RO"/> 
		<bitfield id="NRI_STS" width="1" begin="6" end="6" resetval="0x0" description="This bit is the complement of the RI* input. In loop-back mode it is equivalent to MCR[2]" range="6" rwaccess="RO"/> 
		<bitfield id="NDSR_STS" width="1" begin="5" end="5" resetval="0x0" description="This bit is the complement of the DSR* input. In loop-back mode, it is equivalent to MCR[0]" range="5" rwaccess="RO"/> 
		<bitfield id="NCTS_STS" width="1" begin="4" end="4" resetval="0x0" description="This bit is the complement of the CTS* input. In loop-back mode it is equivalent to MCR[1]" range="4" rwaccess="RO"/> 
		<bitfield id="DCD_STS" width="1" begin="3" end="3" resetval="0x0" description="Indicates that DCD* input [or MCR[3] in loop back] has changed. Cleared on a read." range="3" rwaccess="RO"/> 
		<bitfield id="RI_STS" width="1" begin="2" end="2" resetval="0x0" description="Indicates that RI* input [or MCR[2] in loop back] has changed state from low to high. Cleared on a read." range="2" rwaccess="RO"/> 
		<bitfield id="DSR_STS" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    Read1   |   DSR_STS_VALUE_1Indicates that DSR* input (or MCR[0] in loop back) has changed state. Cleared on a read  " range="1" rwaccess="RO"/> 
		<bitfield id="CTS_STS" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    Read1   |   CTS_STS_VALUE_1Indicates that CTS* input (or MCR[1] in loop back) has changed state. Cleared on a read.  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART4_TLR" acronym="UART4_TLR" offset="0x1C" width="8" description="">
		<bitfield id="RX_FIFO_TRIG_DMA" width="4" begin="7" end="4" resetval="0x0" description="Receive FIFO trigger level" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="TX_FIFO_TRIG_DMA" width="4" begin="3" end="0" resetval="0x0" description="Transmit FIFO trigger level" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="UART4_XOFF2" acronym="UART4_XOFF2" offset="0x1C" width="8" description="">
		<bitfield id="XOFF_WORD2" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XOFF2 character in used in UART modes." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART4_SPR" acronym="UART4_SPR" offset="0x1C" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="SPR_WORD" width="8" begin="7" end="0" resetval="0x0" description="Scratchpad register" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART4_MDR1" acronym="UART4_MDR1" offset="0x20" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="FRAME_END_MODE" width="1" begin="7" end="7" resetval="0x0" description="IrDA mode only.    0   |   FRAME_END_MODE_VALUE_0Frame-length method      1   |   FRAME_END_MODE_VALUE_1Set EOT bit method  " range="7" rwaccess="RW"/> 
		<bitfield id="SIP_MODE" width="1" begin="6" end="6" resetval="0x0" description="MIR/FIR modes only.    0   |   SIP_MODE_VALUE_0Manual SIP mode: SIP is generated with the control of ACREG[3]      1   |   SIP_MODE_VALUE_1Automatic SIP mode: SIP is generated after each transmission.  " range="6" rwaccess="RW"/> 
		<bitfield id="SCT" width="1" begin="5" end="5" resetval="0x0" description="Store and control the transmission    0   |   SCT_VALUE_0Starts the Infrared transmission as soon as a value is written to THR      1   |   SCT_VALUE_1Starts the Infrared transmission with the control of ACREG[2]. Note: before starting any transmission, there must be no reception on going.  " range="5" rwaccess="RW"/> 
		<bitfield id="SET_TXIR" width="1" begin="4" end="4" resetval="0x0" description="Used to configure the infrared transceiver.    0   |   SET_TXIR_VALUE_0No action if MDR2[7]=0. TXIR pin output is forced low if MDR2[7]=1      1   |   SET_TXIR_VALUE_1TXIR pin output is forced high (not dependant of MDR2[7] value).  " range="4" rwaccess="RW"/> 
		<bitfield id="IR_SLEEP" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    0   |   IR_SLEEP_VALUE_0IrDA/CIR sleep mode disabled      1   |   IR_SLEEP_VALUE_1IrDA/CIR sleep mode enabled  " range="3" rwaccess="RW"/> 
		<bitfield id="MODE_SELECT" width="3" begin="2" end="0" resetval="0x7" description="Not Defined    0x0   |   MODE_SELECT_VALUE_0UART 16x mode      0x1   |   MODE_SELECT_VALUE_1SIR mode      0x2   |   MODE_SELECT_VALUE_2UART 16x auto-baud      0x3   |   MODE_SELECT_VALUE_3UART 13x mode      0x4   |   MODE_SELECT_VALUE_4MIR mode      0x5   |   MODE_SELECT_VALUE_5FIR mode      0x6   |   MODE_SELECT_VALUE_6CIR mode      0x7   |   MODE_SELECT_VALUE_7Disable (default state)  " range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="UART4_MDR2" acronym="UART4_MDR2" offset="0x24" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="SET_TXIR_ALT" width="1" begin="7" end="7" resetval="0x0" description="Provide alternate functionnality for MDR1[4] [SET_TXIR]    0   |   SET_TXIR_ALT_VALUE_0Normal mode      1   |   SET_TXIR_ALT_VALUE_1Alternate mode for SET_TXIR  " range="7" rwaccess="RW"/> 
		<bitfield id="IRRXINVERT" width="1" begin="6" end="6" resetval="0x0" description="Only for IR mode [IRDA &#38; CIR]Invert RX pin inside the module before the voting or sampling system logic of the infra red block. This will not affect the RX path in UART Modem modes.    0   |   IRRXINVERT_VALUE_0inversion is performed      1   |   IRRXINVERT_VALUE_1No inversion is performed  " range="6" rwaccess="RW"/> 
		<bitfield id="CIR_PULSE_MODE" width="2" begin="5" end="4" resetval="0x0" description="CIR Pulse modulation definition. It defines high level of the pulse width associated with a digit:    0x0   |   CIR_PULSE_MODE_VALUE_0Pulse width of 3 from 12 cycles      0x1   |   CIR_PULSE_MODE_VALUE_1Pulse width of 4 from 12 cycles      0x2   |   CIR_PULSE_MODE_VALUE_2Pulse width of 5 from 12 cycles      0x3   |   CIR_PULSE_MODE_VALUE_3Pulse width of 6 from 12 cycles  " range="5 - 4" rwaccess="RW"/> 
		<bitfield id="UART_PULSE" width="1" begin="3" end="3" resetval="0x0" description="UART mode only. Used to allow pulse shaping in UART mode.    0   |   UART_PULSE_VALUE_0normal UART mode      1   |   UART_PULSE_VALUE_1UART mode with a pulse shaping  " range="3" rwaccess="RW"/> 
		<bitfield id="STS_FIFO_TRIG" width="2" begin="2" end="1" resetval="0x0" description="Only for IR-IRDA mode.Frame Status FIFO Threshold select:    0x0   |   STS_FIFO_TRIG_VALUE_01 entry      0x1   |   STS_FIFO_TRIG_VALUE_14 entries      0x2   |   STS_FIFO_TRIG_VALUE_27 entries      0x3   |   STS_FIFO_TRIG_VALUE_38 entries  " range="2 - 1" rwaccess="RW"/> 
		<bitfield id="IRTX_UNDERRUN" width="1" begin="0" end="0" resetval="0x0" description="IRDA Transmission status interrupt.When the IIR[5] interrupt occurs, the meaning of the interrupt is :    Read0   |   IRTX_UNDERRUN_VALUE_0the last bit of the frame has been transmitted successfully without error.      Read1   |   IRTX_UNDERRUN_VALUE_1an underrun has occurred. The last bit of the frame has been transmitted but with an underrun error present. The bit is reset to '0' when the RESUME register is read.  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART4_TXFLL" acronym="UART4_TXFLL" offset="0x28" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="TXFLL" width="8" begin="7" end="0" resetval="0x0" description="LSB register used to specify the frame length" range="7 - 0" rwaccess="WO"/>
	</register>
	<register id="UART4_SFLSR" acronym="UART4_SFLSR" offset="0x28" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED5" width="3" begin="7" end="5" resetval="0x0" description="Not Defined" range="7 - 5" rwaccess="RO"/> 
		<bitfield id="OE_ERROR" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    Read1   |   OE_ERROR_VALUE_1Overrun error in RX FIFO when frame at top of RX FIFO was received.  " range="4" rwaccess="RO"/> 
		<bitfield id="FRAME_TOO_LONG_ERROR" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    Read1   |   FRAME_TOO_LONG_ERROR_VALUE_1Frame-length too long error in frame at top of RX FIFO.  " range="3" rwaccess="RO"/> 
		<bitfield id="ABORT_DETECT" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    Read1   |   ABORT_DETECT_VALUE_1Abort pattern detected in frame at top of RX FIFO  " range="2" rwaccess="RO"/> 
		<bitfield id="CRC_ERROR" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    Read1   |   CRC_ERROR_VALUE_1CRC error in frame at top of RX FIFO. top of RX FIFO = Next frame to be read from RX FIFO  " range="1" rwaccess="RO"/> 
		<bitfield id="RESERVED0" width="1" begin="0" end="0" resetval="0x0" description="Not Defined" range="0" rwaccess="RO"/>
	</register>
	<register id="UART4_TXFLH" acronym="UART4_TXFLH" offset="0x2C" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="3" begin="7" end="5" resetval="0x0" description="Not Defined" range="7 - 5" rwaccess="RO"/> 
		<bitfield id="TXFLH" width="5" begin="4" end="0" resetval="0x0" description="MSB register used to specify the frame length" range="4 - 0" rwaccess="WO"/>
	</register>
	<register id="UART4_RESUME" acronym="UART4_RESUME" offset="0x2C" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESUME" width="8" begin="7" end="0" resetval="0x0" description="Dummy read to restart the TX or RX" range="7 - 0" rwaccess="RO"/>
	</register>
