IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART4_UART4.xml
	<register id="UART4_RXFLL" acronym="UART4_RXFLL" offset="0x30" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RXFLL" width="8" begin="7" end="0" resetval="0x0" description="LSB register used to specify the frame length in reception" range="7 - 0" rwaccess="WO"/>
	</register>
	<register id="UART4_SFREGL" acronym="UART4_SFREGL" offset="0x30" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="SFREGL" width="8" begin="7" end="0" resetval="0x0" description="LSB part of the frame length" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="UART4_RXFLH" acronym="UART4_RXFLH" offset="0x34" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="4" begin="7" end="4" resetval="0x0" description="Not Defined" range="7 - 4" rwaccess="RO"/> 
		<bitfield id="RXFLH" width="4" begin="3" end="0" resetval="0x0" description="MSB register used to specify the frame length in reception" range="3 - 0" rwaccess="WO"/>
	</register>
	<register id="UART4_SFREGH" acronym="UART4_SFREGH" offset="0x34" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="4" begin="7" end="4" resetval="0x0" description="Not Defined" range="7 - 4" rwaccess="RO"/> 
		<bitfield id="SFREGH" width="4" begin="3" end="0" resetval="0x0" description="MSB part of the frame length" range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="UART4_UASR" acronym="UART4_UASR" offset="0x38" width="8" description="">
		<bitfield id="PARITY_TYPE" width="2" begin="7" end="6" resetval="0x0" description="00 => No Parity identified. 01 => Parity space. 10 => Even Parity. 11 => Odd Parity" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="BIT_BY_CHAR" width="1" begin="5" end="5" resetval="0x0" description="0 => 7 bits character identified. 1 => 8 bits character identified" range="5" rwaccess="RO"/> 
		<bitfield id="SPEED" width="5" begin="4" end="0" resetval="0x0" description="Used to report the speed identified. 00000 => No speed identified. 00001 => 115200 bauds. 00010 => 57600 bauds. 00011 => 38400 bauds. 00100 => 28800 bauds. 00101 => 19200 bauds. 00110 => 14400 bauds. 00111 => 9600 bauds. 01000 => 4800 bauds. 01001 => 2400 bauds. 01010 => 1200 bauds" range="4 - 0" rwaccess="RO"/>
	</register>
	<register id="UART4_BLR" acronym="UART4_BLR" offset="0x38" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="STS_FIFO_RESET" width="1" begin="7" end="7" resetval="0x0" description="Status FIFO reset. This bit is self-clearing" range="7" rwaccess="RW"/> 
		<bitfield id="XBOF_TYPE" width="1" begin="6" end="6" resetval="0x1" description="SIR xBOF select.    0   |   XBOF_TYPE_VALUE_00xFF      1   |   XBOF_TYPE_VALUE_10xC0  " range="6" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="6" begin="5" end="0" resetval="0x0" description="Not Defined" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="UART4_ACREG" acronym="UART4_ACREG" offset="0x3C" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="PULSE_TYPE" width="1" begin="7" end="7" resetval="0x0" description="SIR pulse width select:    0   |   PULSE_TYPE_VALUE_03/16 of baud-rate pulse width      1   |   PULSE_TYPE_VALUE_11.6us  " range="7" rwaccess="RW"/> 
		<bitfield id="SD_MOD" width="1" begin="6" end="6" resetval="0x0" description="Primary output used to configure transceivers. Connected to the SD/MODE input pin of IrDA transceivers.    0   |   SD_MOD_VALUE_0SD pin is set to high      1   |   SD_MOD_VALUE_1SD pin is set to low  " range="6" rwaccess="RW"/> 
		<bitfield id="DIS_IR_RX" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    0   |   DIS_IR_RX_VALUE_0Normal operation (RX input automatically disabled during transmit but enabled outside of transmit operation).      1   |   DIS_IR_RX_VALUE_1Disables RX input (permanent state - independent of transmit).  " range="5" rwaccess="RW"/> 
		<bitfield id="DIS_TX_UNDERRUN" width="1" begin="4" end="4" resetval="0x0" description="It is recommended to disable TX FIFO underrun capability by masking corresponding underrun interrupt. When disabling underrun by setting ACREG[4]=1, garbage data is sent over TX line.    0   |   DIS_TX_UNDERRUN_VALUE_0Long stop bits cannot be transmitted, TX underrun is enabled      1   |   DIS_TX_UNDERRUN_VALUE_1Long stop bits can be transmitted, TX underrun is disabled  " range="4" rwaccess="RW"/> 
		<bitfield id="SEND_SIP" width="1" begin="3" end="3" resetval="0x0" description="MIR/FIR Modes only.Send Serial Infrared Interaction Pulse [SIP]If this bit is set during a MIR/FIR transmission, the SIP will be send at the end of it.This bit automatically gets cleared at the end of the SIP transmission.    0   |   SEND_SIP_VALUE_0No action      1   |   SEND_SIP_VALUE_1Send SIP pulse.  " range="3" rwaccess="RW"/> 
		<bitfield id="SCTX_EN" width="1" begin="2" end="2" resetval="0x0" description="Store and controlled TX start. When MDR1[5] = 1 and the LH writes 1 to this bit the TX state machine starts frame transmission. This bit is self-clearing." range="2" rwaccess="RW"/> 
		<bitfield id="ABORT_EN" width="1" begin="1" end="1" resetval="0x0" description="Frame Abort. The LH can intentionally abort transmission of a frame by writing 1 to this bit. Neither the end flag nor the CRC bits are appended to the frame.   If transmit FIFO is not empty and MDR1[5]=1, UART IrDA will start a new transfer with data of previous frame as soon as abort frame has been sent. Therefore, TX FIFO must be reset before sending an abort frame." range="1" rwaccess="RW"/> 
		<bitfield id="EOT_EN" width="1" begin="0" end="0" resetval="0x0" description="EOT [end of transmission] bit. The LH writes 1 to this bit just before it writes the last byte to the TX FIFO in set-EOT bit frame closing method. This bit automatically gets cleared when the LH writes to the THR [TX FIFO]." range="0" rwaccess="RW"/>
	</register>
	<register id="UART4_SCR" acronym="UART4_SCR" offset="0x40" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RX_TRIG_GRANU1" width="1" begin="7" end="7" resetval="0x0" description="Not Defined    0   |   RX_TRIG_GRANU1_VALUE_0DISABLES THE GRANULARITY OF 1 FOR TRIGGER RX LEVEL.      1   |   RX_TRIG_GRANU1_VALUE_1ENABLES THE GRANULARITY OF 1 FOR TRIGGER RX LEVEL.  " range="7" rwaccess="RW"/> 
		<bitfield id="TX_TRIG_GRANU1" width="1" begin="6" end="6" resetval="0x0" description="Not Defined    0   |   TX_TRIG_GRANU1_VALUE_0DISABLES THE GRANULARITY OF 1 FOR TRIGGER TX LEVEL.      1   |   TX_TRIG_GRANU1_VALUE_1Enables the granularity of 1 for trigger TX level.  " range="6" rwaccess="RW"/> 
		<bitfield id="DSR_IT" width="1" begin="5" end="5" resetval="0x0" description="Not Defined    0   |   DSR_IT_VALUE_0DISABLES DSR* INTERRUPT.      1   |   DSR_IT_VALUE_1ENABLES DSR* INTERRUPT.  " range="5" rwaccess="RW"/> 
		<bitfield id="RX_CTS_DSR_WAKE_UP_ENABLE" width="1" begin="4" end="4" resetval="0x0" description="Not Defined    0   |   RX_CTS_DSR_WAKE_UP_ENABLE_VALUE_0DISABLES THE WAKE UP INTERRUPT AND CLEARS SSR[1].      1   |   RX_CTS_DSR_WAKE_UP_ENABLE_VALUE_1Waits for a falling edge of pins RX, CTS* or DSR* to generate an interrupt  " range="4" rwaccess="RW"/> 
		<bitfield id="TX_EMPTY_CTL_IT" width="1" begin="3" end="3" resetval="0x0" description="Not Defined    0   |   TX_EMPTY_CTL_IT_VALUE_0Normal mode for THR interrupt (See UART mode interrupts table).      1   |   TX_EMPTY_CTL_IT_VALUE_1THE THR INTERRUPT IS GENERATED WHEN TX FIFO AND TX SHIFT REGISTER ARE EMPTY.  " range="3" rwaccess="RW"/> 
		<bitfield id="DMA_MODE_2" width="2" begin="2" end="1" resetval="0x0" description="Used to specify the DMA mode valid if SCR[0] = 1    0x0   |   DMA_MODE_2_VALUE_0DMA mode 0 (no DMA)      0x1   |   DMA_MODE_2_VALUE_1DMA mode 1 (UART_nDMA_REQ[0] in TX, UART_nDMA_REQ[1] in RX)      0x2   |   DMA_MODE_2_VALUE_2DMA mode 2 (UART_nDMA_REQ[0] in RX)      0x3   |   DMA_MODE_2_VALUE_3DMA mode 3 (UART_nDMA_REQ[0] in TX)  " range="2 - 1" rwaccess="RW"/> 
		<bitfield id="DMA_MODE_CTL" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    0   |   DMA_MODE_CTL_VALUE_0The DMA_MODE is set with FCR[3]      1   |   DMA_MODE_CTL_VALUE_1The DMA_MODE is set with SCR[2:1]  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART4_SSR" acronym="UART4_SSR" offset="0x44" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="5" begin="7" end="3" resetval="0x0" description="Not Defined" range="7 - 3" rwaccess="RO"/> 
		<bitfield id="DMA_COUNTER_RST" width="1" begin="2" end="2" resetval="0x1" description="Not Defined    0   |   DMA_COUNTER_RST_VALUE_0The DMA counter will not be reset if the corresponding FIFO is reset (via FCR[1] or FCR[2])      1   |   DMA_COUNTER_RST_VALUE_1The DMA counter will be reset if corresponding FIFO is reset (via FCR[1] or FCR[2])  " range="2" rwaccess="RW"/> 
		<bitfield id="RX_CTS_DSR_WAKE_UP_STS" width="1" begin="1" end="1" resetval="0x0" description="Not Defined    Read0   |   RX_CTS_DSR_WAKE_UP_STS_VALUE_0No falling edge event on RX, CTS* and DSR*      Read1   |   RX_CTS_DSR_WAKE_UP_STS_VALUE_1A falling edge occurred on RX, CTS* or DSR*  " range="1" rwaccess="RO"/> 
		<bitfield id="TX_FIFO_FULL" width="1" begin="0" end="0" resetval="0x0" description="Not Defined    Read0   |   TX_FIFO_FULL_VALUE_0TX FIFO is not full      Read1   |   TX_FIFO_FULL_VALUE_1TX FIFO is full.  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART4_EBLR" acronym="UART4_EBLR" offset="0x48" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="EBLR" width="8" begin="7" end="0" resetval="0x0" description="IR-IRDA mode: This register allows to define up to 176 xBOFs, the maximum required by IrDA specification.IR-CIR mode: This register specifies the number of consecutive zeros to be received before generating the RX_STOP interrupt [IIR[2]].0x00: feature disabled.0x01: generate RX_STOP interrupt after receiving one zero bit....0xFF: generate RX_STOP interrupt after receiving 255 zero bits." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART4_MVR" acronym="UART4_MVR" offset="0x50" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Scheme revision number of module" range="31 - 30" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="2" begin="29" end="28" resetval="0x0" description="Not Defined" range="29 - 28" rwaccess="RO"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1858" description="Function revision number of module" range="27 - 16" rwaccess="RO"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x8" description="Rtl revision number of module" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x6" description="Major revision number of the module." range="10 - 8" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom revision number of the module." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x3" description="Minor revision number of the module." range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="UART4_SYSC" acronym="UART4_SYSC" offset="0x54" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="3" begin="7" end="5" resetval="0x0" description="Not Defined" range="7 - 5" rwaccess="RO"/> 
		<bitfield id="IDLEMODE" width="2" begin="4" end="3" resetval="0x0" description="POWER MANAGEMENT REQ/ACK CONTROLREF: OCP DESIGN GUIDELINES VERSION 1.1    0x0   |   IDLEMODE_VALUE_0Force idle. An idle request is acknowledged unconditionally      0x1   |   IDLEMODE_VALUE_1No-idle. An idle request is never acknowledged.      0x2   |   IDLEMODE_VALUE_2Smart idle. Acknowledgement to an idle request is given based in the internal activity of the module.      0x3   |   IDLEMODE_VALUE_3reserved  " range="4 - 3" rwaccess="RW"/> 
		<bitfield id="ENAWAKEUP" width="1" begin="2" end="2" resetval="0x0" description="WAKE UP FEATURE CONTROL    0   |   ENAWAKEUP_VALUE_0Wake up is disabled      1   |   ENAWAKEUP_VALUE_1Wake up capability is enabled  " range="2" rwaccess="RW"/> 
		<bitfield id="SOFTRESET" width="1" begin="1" end="1" resetval="0x0" description="Software reset. Set this bit to 1 to trigger a module reset. This bit is automatically reset by the hardware. During reads it always returns a 0.    Write0   |   SOFTRESET_VALUE_0Normal mode      Write1   |   SOFTRESET_VALUE_1The module is reset  " range="1" rwaccess="WO"/> 
		<bitfield id="AUTOIDLE" width="1" begin="0" end="0" resetval="0x0" description="Internal OCP clock gating strategy    0   |   AUTOIDLE_VALUE_0Clock is running      1   |   AUTOIDLE_VALUE_1Automatic OCP clock gating strategy is applied, based on the OCP interface activity  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART4_SYSS" acronym="UART4_SYSS" offset="0x58" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="7" begin="7" end="1" resetval="0x0" description="Not Defined" range="7 - 1" rwaccess="RO"/> 
		<bitfield id="RESETDONE" width="1" begin="0" end="0" resetval="0x0" description="Internal Reset Monitoring    Read0   |   RESETDONE_VALUE_0Internal Module Reset is ongoing      Read1   |   RESETDONE_VALUE_1Reset completed  " range="0" rwaccess="RO"/>
	</register>
	<register id="UART4_WER" acronym="UART4_WER" offset="0x5C" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="EVENT_7_TX_WAKEUP_EN" width="1" begin="7" end="7" resetval="0x1" description="Not Defined    0   |   EVENT_7_TX_WAKEUP_EN_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_7_TX_WAKEUP_EN_VALUE_1EVENT CAN WAKE UP THE SYSTEM: Event can be: THR_IT or TX_DMA request and/or TX_SATUS_IT  " range="7" rwaccess="RW"/> 
		<bitfield id="EVENT_6_RECEIVER_LINE_STATUS_INTERRUPT" width="1" begin="6" end="6" resetval="0x1" description="Not Defined    0   |   EVENT_6_RECEIVER_LINE_STATUS_INTERRUPT_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_6_RECEIVER_LINE_STATUS_INTERRUPT_VALUE_1Event can wake up the system  " range="6" rwaccess="RW"/> 
		<bitfield id="EVENT_5_RHR_INTERRUPT" width="1" begin="5" end="5" resetval="0x1" description="Not Defined    0   |   EVENT_5_RHR_INTERRUPT_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_5_RHR_INTERRUPT_VALUE_1Event can wake up the system  " range="5" rwaccess="RW"/> 
		<bitfield id="EVENT_4_RX_ACTIVITY" width="1" begin="4" end="4" resetval="0x1" description="Not Defined    0   |   EVENT_4_RX_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_4_RX_ACTIVITY_VALUE_1Event can wake up the system  " range="4" rwaccess="RW"/> 
		<bitfield id="EVENT_3_DCD_CD_ACTIVITY" width="1" begin="3" end="3" resetval="0x1" description="Not Defined    0   |   EVENT_3_DCD_CD_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_3_DCD_CD_ACTIVITY_VALUE_1Event can wake up the system  " range="3" rwaccess="RW"/> 
		<bitfield id="EVENT_2_RI_ACTIVITY" width="1" begin="2" end="2" resetval="0x1" description="Not Defined    0   |   EVENT_2_RI_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_2_RI_ACTIVITY_VALUE_1Event can wake up the system  " range="2" rwaccess="RW"/> 
		<bitfield id="EVENT_1_DSR_ACTIVITY" width="1" begin="1" end="1" resetval="0x1" description="Not Defined    0   |   EVENT_1_DSR_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_1_DSR_ACTIVITY_VALUE_1Event can wake up the system  " range="1" rwaccess="RW"/> 
		<bitfield id="EVENT_0_CTS_ACTIVITY" width="1" begin="0" end="0" resetval="0x1" description="Not Defined    0   |   EVENT_0_CTS_ACTIVITY_VALUE_0Event is not allowed to wake up the system      1   |   EVENT_0_CTS_ACTIVITY_VALUE_1Event can wake up the system  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART4_CFPS" acronym="UART4_CFPS" offset="0x60" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="CFPS" width="8" begin="7" end="0" resetval="0x105" description="System clock frequency prescaler at [12x multiple]. Examples for CFPS values are given in the table below.Target Freq [KHz] CFPS [decimal] Actual Freq[KHz] 30   133  30.08 32.75   122  32.79 36   111  36.04 36.7   109  36.69 38*   105  38.1 40   100  40 56.8   70  57.14* configured at reset to this valueNote: CFPS = 0 is not supported." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART4_RXFIFO_LVL" acronym="UART4_RXFIFO_LVL" offset="0x64" width="32" description="">
		<bitfield id="RESERVED24" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RXFIFO_LVL" width="8" begin="7" end="0" resetval="0x0" description="Not Defined" range="7 - 0" rwaccess="RO"/>
	</register>
