IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART4_UART4.xml
	<register id="UART4_TXFIFO_LVL" acronym="UART4_TXFIFO_LVL" offset="0x68" width="32" description="">
		<bitfield id="RESERVED24" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="TXFIFO_LVL" width="8" begin="7" end="0" resetval="0x0" description="Not Defined" range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="UART4_IER2" acronym="UART4_IER2" offset="0x6C" width="32" description="">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="5" begin="7" end="3" resetval="0x0" description="Not Defined" range="7 - 3" rwaccess="RO"/> 
		<bitfield id="RHR_IT_DIS" width="1" begin="2" end="2" resetval="0x0" description="Not Defined    0   |   RHR_IT_DIS_VALUE_0Enables the RHR interrupt.      1   |   RHR_IT_DIS_VALUE_1Disables the RHR interrupt.  " range="2" rwaccess="RW"/> 
		<bitfield id="EN_TXFIFO_EMPTY" width="1" begin="1" end="1" resetval="0x0" description="Enables[1]/DISABLES[00 EN_TXFIFO_EMPTY interrupt." range="1" rwaccess="RW"/> 
		<bitfield id="EN_RXFIFO_EMPTY" width="1" begin="0" end="0" resetval="0x0" description="Enables[1]/disables[0] EN_RXFIFO_EMPTY interrupt." range="0" rwaccess="RW"/>
	</register>
	<register id="UART4_ISR2" acronym="UART4_ISR2" offset="0x70" width="32" description="">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="6" begin="7" end="2" resetval="0x0" description="Not Defined" range="7 - 2" rwaccess="RO"/> 
		<bitfield id="TXFIFO_EMPTY_STS" width="1" begin="1" end="1" resetval="0x1" description="TXFIFO interrupt pending    0   |   TXFIFO_EMPTY_STS_VALUE_0TXFIFO_EMPTY interrupt not pending.      1   |   TXFIFO_EMPTY_STS_VALUE_1TXFIFO_EMPTY interrupt pending.  " range="1" rwaccess="RW"/> 
		<bitfield id="RXFIFO_EMPTY_STS" width="1" begin="0" end="0" resetval="0x1" description="RXFIFO interrupt pending    0   |   RXFIFO_EMPTY_STS_VALUE_0RXFIFO_EMPTY interrupt not pending.      1   |   RXFIFO_EMPTY_STS_VALUE_1RXFIFO_EMPTY interrupt pending.  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART4_FREQ_SEL" acronym="UART4_FREQ_SEL" offset="0x74" width="32" description="">
		<bitfield id="FREQ_SEL" width="8" begin="7" end="0" resetval="0x26" description="Sets the sample per bit if non default frequency is used. MDR3[1] must be set to 1 after this value is set. Must be equal or higher then 6." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART4_ABAUD_1ST_CHAR" acronym="UART4_ABAUD_1ST_CHAR" offset="0x78" width="32" description="">
		<bitfield id="RESERVED" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="UART4_BAUD_2ND_CHAR" acronym="UART4_BAUD_2ND_CHAR" offset="0x7C" width="32" description="">
		<bitfield id="RESERVED" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="UART4_MDR3" acronym="UART4_MDR3" offset="0x80" width="32" description="">
		<bitfield id="RESERVED2" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="DIR_EN" width="1" begin="4" end="4" resetval="0x0" description="RS-485 External Transceiver Direction Enable" range="4" rwaccess="RW"/> 
		<bitfield id="DIR_POL" width="1" begin="3" end="3" resetval="0x0" description="RS-485 External Transceiver Direction Polarity. 0 => TX: RTS=0, RX: RTS=1. 1 => TX: RTS=1, RX: RTS=0" range="3" rwaccess="RW"/> 
		<bitfield id="SET_DMA_TX_THRESHOLD" width="1" begin="2" end="2" resetval="0x0" description="Enable to set different TX DMA threshold then 64-trigger [usage of new register TX_DNA_THRESHOLD]" range="2" rwaccess="RW"/> 
		<bitfield id="NONDEFAULT_FREQ" width="1" begin="1" end="1" resetval="0x0" description="Enables[1]/Disables[0] using NONDEFAULT  fclk frequencies" range="1" rwaccess="RW"/> 
		<bitfield id="DISABLE_CIR_RX_DEMOD" width="1" begin="0" end="0" resetval="0x0" description="Disables[1]/Enables[0] CIR RX demodulation    0   |   DISABLE_CIR_RX_DEMOD_VALUE_0Enables CIR RX demodulation      1   |   DISABLE_CIR_RX_DEMOD_VALUE_1Disables CIR RX demodulation  " range="0" rwaccess="RW"/>
	</register>
	<register id="UART4_TX_DMA_THRESHOLD" acronym="UART4_TX_DMA_THRESHOLD" offset="0x84" width="32" description="">
		<bitfield id="TX_DMA_THRESHOLD" width="6" begin="5" end="0" resetval="0x0" description="Use to manually set the TX DMA threshold level." range="5 - 0" rwaccess="RW"/>
	</register>
	<register id="UART4_MDR4" acronym="UART4_MDR4" offset="0x88" width="32" description="">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="1" begin="7" end="7" resetval="0x0" description="Not Defined" range="7" rwaccess="RO"/> 
		<bitfield id="MODE9" width="1" begin="6" end="6" resetval="0x0" description="9-bit character length. When '1', overrides character length setting in LCR" range="6" rwaccess="RW"/> 
		<bitfield id="FREQ_SEL_H" width="3" begin="5" end="3" resetval="0x0" description="Upper 3 bits of FREQ_SEL register for higher division values, as required for example for FI/Di in ISO7816 mode" range="5 - 3" rwaccess="RW"/> 
		<bitfield id="MODE" width="3" begin="2" end="0" resetval="0x0" description="New modes [when set, overrides MDR1 modes]    0x0   |   DISABLEDdisabled (no override)      0x1   |   RESERVEDreserved      0x2   |   SYNCH_EXTSynchronous mode with external clock      0x3   |   SYNCH_GENSynchronous mode with generated clock      0x4   |   ISO7816_0ISO 7816 mode T=0      0x5   |   ISO7816_1ISO 7816 mode T=1      0x6   |   RESERVED1reserved      0x7   |   RESERVED2reserved  " range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="UART4_EFR2" acronym="UART4_EFR2" offset="0x8C" width="32" description="">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="BROADCAST" width="1" begin="7" end="7" resetval="0x0" description="Enables broadcast address matching in multi-drop address match mode" range="7" rwaccess="RW"/> 
		<bitfield id="TIMEOUT_BEHAVE" width="1" begin="6" end="6" resetval="0x0" description="Specifies how timeout is measured    0   |   _0timeout after at least one character has been received      1   |   _1periodic timeout even when no character has been received  " range="6" rwaccess="RW"/> 
		<bitfield id="C8" width="1" begin="5" end="5" resetval="0x0" description="Value for ISO 7816 C8 pin for software control" range="5" rwaccess="RW"/> 
		<bitfield id="C4" width="1" begin="4" end="4" resetval="0x0" description="Value for ISO 7816 C4 pin for software control" range="4" rwaccess="RW"/> 
		<bitfield id="C2" width="1" begin="3" end="3" resetval="0x0" description="Value for ISO 7816 reset pin [software controllable]" range="3" rwaccess="RW"/> 
		<bitfield id="MULTIDROP" width="1" begin="2" end="2" resetval="0x0" description="Enables parity Multi-drop mode [overrides LCR[5..3]] when '1'" range="2" rwaccess="RW"/> 
		<bitfield id="RHR_OVERRUN" width="1" begin="1" end="1" resetval="0x0" description="RHR Overrun behaviour when buffer full    0   |   DEFAULTdata in RHR is not overwritten (standard)      1   |   ATMELdata in RHR is overwritten when buffer full (and FIFO disabled)  " range="1" rwaccess="RW"/> 
		<bitfield id="ENDIAN" width="1" begin="0" end="0" resetval="0x0" description="Endianness    0   |   LOW_ENDIANLittle Endian (LSB First)      1   |   BIG_ENDIANBig Endian (MSB First)  " range="0" rwaccess="RW"/>
	</register>
