IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/UART4_UART4.xml
	<register id="UART4_ECR" acronym="UART4_ECR" offset="0x90" width="32" description="">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="RESERVED" width="2" begin="7" end="6" resetval="0x0" description="Not Defined" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="CLEAR_TX_PE" width="1" begin="5" end="5" resetval="0x0" description="Write 1 to clear parity error from the Transmitter to allow it to continue to try sending data [ISO7816 transmit only]" range="5" rwaccess="WO"/> 
		<bitfield id="TX_EN" width="1" begin="4" end="4" resetval="0x1" description="Enables/Disables the transmitter    0   |   DISABLEDTransmitter is shut down      1   |   ENABLEDTransmitter is working  " range="4" rwaccess="RW"/> 
		<bitfield id="RX_EN" width="1" begin="3" end="3" resetval="0x1" description="Enables/Disables the receiver    0   |   DISABLEDReceiver is shut down      1   |   ENABLEDReceiver is operating  " range="3" rwaccess="RW"/> 
		<bitfield id="TX_RST" width="1" begin="2" end="2" resetval="0x0" description="Writing '1' resets the transmitter" range="2" rwaccess="WO"/> 
		<bitfield id="RX_RST" width="1" begin="1" end="1" resetval="0x0" description="Writing '1' resets the receiver" range="1" rwaccess="WO"/> 
		<bitfield id="A_MULTIDROP" width="1" begin="0" end="0" resetval="0x0" description="In multi-drop mode, when written with the value '1' causes the next byte written into THR to be transmitted with the parity bit set, signaling an address" range="0" rwaccess="WO"/>
	</register>
	<register id="UART4_TIMEGUARD" acronym="UART4_TIMEGUARD" offset="0x94" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="TIMEGUARD" width="8" begin="7" end="0" resetval="0x0" description="Specifies the amount of idle baud clocks [transmitter bit period] to  insert between  transmitted bytes, useful when comunicating with slower devices" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART4_TIMEOUTL" acronym="UART4_TIMEOUTL" offset="0x98" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="TIMEOUT_L" width="8" begin="7" end="0" resetval="0x0" description="Custom timeout period in baud clocks, to override the internal value, when different from 0. [Lower byte of the 16 bit value]" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART4_TIMEOUTH" acronym="UART4_TIMEOUTH" offset="0x9C" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="TIMEOUT_H" width="8" begin="7" end="0" resetval="0x0" description="Custom timeout period in baud clocks, to override the internal value, when different from 0. [Higher byte of the 16 bit value]" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART4_SCCR" acronym="UART4_SCCR" offset="0xA0" width="32" description="">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="Not Defined" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="DSNACK" width="1" begin="7" end="7" resetval="0x0" description="Applies Max_Iteration to receiver aswell - when maximum number of NACKs  have been returned, the receiver will accept the data regardless of error. The data will be loaded into the receiver FIFO and PE will be set when reading it." range="7" rwaccess="RW"/> 
		<bitfield id="INACK" width="1" begin="6" end="6" resetval="0x0" description="Inhibit NACK when receiving, even if an error is received. The data will be loaded into the receiver FIFO and PE will be set when reading it." range="6" rwaccess="RW"/> 
		<bitfield id="RESERVED" width="3" begin="5" end="3" resetval="0x0" description="Not Defined" range="5 - 3" rwaccess="RO"/> 
		<bitfield id="MAX_ITERATION" width="3" begin="2" end="0" resetval="0x7" description="Number of times to repeat transmitted character, if the receiver did not acknowledge. If not acknowledged after the max value is reached, the USART transmitter will set parity error, stop and not continue until it is cleared." range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="UART4_ETHR" acronym="UART4_ETHR" offset="0xA4" width="32" description="">
		<bitfield id="RESERVED" width="23" begin="31" end="9" resetval="0x0" description="Not Defined" range="31 - 9" rwaccess="RO"/> 
		<bitfield id="ETHR" width="9" begin="8" end="0" resetval="0x0" description="Extended Transmit Holding Register - allows writing the full 9bit RHR" range="8 - 0" rwaccess="WO"/>
	</register>
	<register id="UART4_ERHR" acronym="UART4_ERHR" offset="0xA4" width="32" description="">
		<bitfield id="RESERVED" width="23" begin="31" end="9" resetval="0x0" description="Not Defined" range="31 - 9" rwaccess="RO"/> 
		<bitfield id="ERHR" width="9" begin="8" end="0" resetval="0x0" description="Extended Receive Holding Register - allows accessing the full 9bit RHR" range="8 - 0" rwaccess="RO"/>
	</register>
	<register id="UART4_MAR" acronym="UART4_MAR" offset="0xA8" width="8" description="">
		<bitfield id="ADDRESS" width="8" begin="7" end="0" resetval="0x0" description="Multidrop match address value" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART4_MMR" acronym="UART4_MMR" offset="0xAC" width="8" description="">
		<bitfield id="MASK" width="8" begin="7" end="0" resetval="0x0" description="Address match masking value ? writing a 0 to a bit means that the corresponding address bit will be ignored in matching" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="UART4_MBR" acronym="UART4_MBR" offset="0xB0" width="8" description="">
		<bitfield id="BROADCAST_ADDRESS" width="8" begin="7" end="0" resetval="0x0" description="Broadcast address for address matching" range="7 - 0" rwaccess="RW"/>
	</register>
</module>